[
    {
        "person": "Aunger, Molly",
        "overall": 60.11,
        "remarks": [
            "I think that Molly has a lot of project management experience, and is clearly excellent at engaging with people and communicating. I'm unsure of her interest in CJ, but I think that's okay. I couldn't quite gather how familiar she is with management of more technical deliverables, but I'm encouraged by her experience working with what seems like a range of vendors.",
            "I like what Molly brings to this position. My biggest concern is that she has worked within an academic environment and the processes and procedures are very different than how we operate. She's also used to coordinating across independent projects and hasn't really had to balance a portfolio of work.  I think there will be a large learning curve, but she seems up for it.  I don't think she's ever had to deal with performance issues because of the structure at the Collaboratory, so that will be new. ",
            "There were a couple of questions -especially regarding describing specific challenges - that she didn't fully answer. Also, she seemed to have limited experience managing simultaneous/competing demands among projects.",
            "It seems like she could be a good person for this role based on her resume and her attitude in the interview, but I feel like I still need more information about her prior experiences, especially as they relate to the things we are evaluating in this form. I thought she did ok, until I started filling this form out and couldn't \"strongly agree\" on any of the metrics. \nIn her presentation, she didn't really provide many examples of things she has actually done or projects she has managed, Jess's instructions clearly asking for that. I felt like some of her responses didn't really answer the question, and she didn't talk much about actual scenarios she has dealt with. I guess we didn't ask for that specifically, but I expected her to have more examples based on the types of work she described doing in her current job. It's really easy to say what you would do in a hypothetical situation, and I'd rather hear about times that you actually tried those things, even if they didn't work out. \nI think since this is a new position, it's important for the person in this role to have a track record of handling the types of challenges we expect them to encounter. I don't know if Molly has that - maybe she's a bad interviewer, maybe she hasn't been able to show her skills due to how Yale operates? But going off of what information I have available, I'm not sold on her."
        ],
        "unique": [
            "Molly has decades of experience working with extremely large budgets, which is very comforting and will be enormously helpful.",
            "Molly presents as an effective collaborator and has experience navigating within a large institution.",
            "Molly has 7 years of coordinating projects at the Yale Justice Collaboratory. She has become a jack-of-all-trades within her organization, so she has experience across a wide array of responsibilities.  She has done a lot of mentoring of junior researchers in operations/procedures, allowing them to focus on their research. She is approachable and likes to solve problems.  ",
            "Really loved Molly's focus on relationships being key to accomplishing projects! She seemed like someone who loves to get things done and would be excited to build systems required to do it. She also shared that she enjoyed enabling and supporting other staff in achieving project goals, which is exactly what we are looking for in this candidate.",
            "Mentioned how to find ways to make things happen, even in an environment steeped in red tape. Understands importance of building relationships/trust to make something happen. I think the quality Molly described in herself -- about being level-headed and even-tempered is really valuable in this type of role.",
            "Molly seemed really nice, relatable, and I think she'd be easy to work with. I think she has plenty of relevant experience, but she did not provide clear examples of her work or how she manages project challenges.",
            "Molly seems like a very kind, honest, thoughtful and experienced person. She is a person that would get along with all types of team members and be a really nice colleague to everyone.",
            "She puts a high value on collaboration and relationship-building. I really liked her answer about checking in with someone who is failing to make deadlines to first make sure they are ok, and what she said about getting better solutions from a diverse group of people. I also liked her idea to develop 3/6/9/12 month goals for the position. I think having a varied background would be a benefit to a role like this that will need to work with a variety of people/positions across projects. And she is familiar with Fluxx!"
        ],
        "presentation": {
            "outcomes": 3.33,
            "timekeeping": 4.0,
            "projmanagement": 3.44,
            "deliverabletime": 3.56,
            "challenges": 4.0,
            "presentation": 3.33,
            "feedback": 3.33,
            "completeness": 3.78
        },
        "professional": {
            "cj": 4.0,
            "comms": 4.0,
            "passion": 3.67,
            "preparation": 4.22
        },
        "knowledge": {
            "rprojcoordination": 4.0,
            "rbudgcoordination": 4.0,
            "rdevorg": 3.67,
            "rtopol": 3.78
        }
    },
    {
        "person": "Gonzales-Bricker, Jess",
        "overall": 75.22,
        "remarks": [
            "I think Jess would be great in this position, and she's be equipped to start on day 1",
            "Despite lacking direct grant budget experience, demonstrated working knowledge of budget elements that are important to consider in general, and working with a budget. ",
            "I think her past experience working at CSG is invaluable. Even though I joined after she left, it's clear her experiences with and knowledge of CSG, the research division's work, and people in the organization would definitely be a great asset and make her a great manager in this position. ",
            "Jess brings with her a great sense of humor and humility, an intimate knowledge of Justice Center operations and culture, and is very well organized.  We have worked very well with Jess in the past and I am confident that she would be great in this role.",
            "Seems like a great person to work with.",
            "Jess would be someone with a lot to learn, but a quickly learner and ready to take on many responsibilities quickly.",
            "Doesn't have budget experience yet, but seems to have some recent experience thinking about the staffing component. Since this role requires someone to be integrally involved with staffing allocations and budget monitoring, those may be areas of development for Jess GB."
        ],
        "unique": [
            "Deep institutional knowledge of the Justice Center, and a long history of working in the criminal justice space (csgcj + texas state agencies). ",
            "Knowledge of research division projects and unique understanding of division needs. ",
            "Her past experience in the research division gives her a unique understanding of the research division and would likely accelerate the impact she would have in the position. ",
            "Jess has many years of experience working within the Research Division here, so she knows the challenges better than anyone else.  While most of her experience at The Justice Center was not in an operations or management role, she provided clear examples of where she provided that support and how she would use that experience to help her in a new role.  She has a great deal of experience working with policymakers and other stakeholders and knows how to center communities in research and its presentation.",
            "Extensive research experience that is very useful for a non-research job, and valuable knowledge of how the Justice Center works",
            "Jess prepared a really polished presentation. She has a long prior tenure with CSG and brings a wealth of institutional knowledge and experience that would serve her well in this role. Jess understands how CSG works and how to work across CSG's divisions. ",
            "Jess is uniquely positioned to understand CSG culture, the Criminal justice system and various agencies, and the capability to engage both internally and externally with a variety of no individuals ",
            "Specific knowledge about the Justice Center, and many years of experience here. If someone in this role would be asked to assist with developing/editing presentations, then Jess GB is VERY strong in this area. Her experience having worked cross-divisionally is helpful to navigate some of the conversations/negotiations that would be required of someone in this role."
        ],
        "presentation": {
            "outcomes": 4.89,
            "timekeeping": 4.78,
            "projmanagement": 4.22,
            "deliverabletime": 4.89,
            "challenges": 4.33,
            "presentation": 4.89,
            "feedback": 5.0,
            "completeness": 4.78
        },
        "professional": {
            "cj": 5.0,
            "comms": 4.78,
            "passion": 5.0,
            "preparation": 5.0
        },
        "knowledge": {
            "rprojcoordination": 4.44,
            "rbudgcoordination": 3.44,
            "rdevorg": 4.78,
            "rtopol": 5.0
        }
    }
]