[
    {
        "id": 1,
        "title": "snExplorer",
        "description": "{snExplorer} is a parsimonious R Shiny application for interactive visualization and analysis of social networks. Underneath the hood, this tool uses igraph and other R packages to provide a user-friendly interface for exploring social networks.",
        "imageUrl": "/landing.png",
        "datetime": "2019-03-01",
        "category": [
            "R"
        ],
        "more": {
            "href": "https://github.com/cllghn/snExplorer",
            "text": "Read more on Github"
        }
    },
    {
        "id": 2,
        "title": "NCDACdb",
        "description": "A Python tool for downloading and creating a local database from files obtained through the North Carolina Department Of Adult Correction Offender Public Information site. The site provides a links to files of North Carolina Department of Adult Correction offender related data. The files contain all public information on all NC Department of Adult Correction offenders convicted since 1972. The data files are zipped and their approximate size is listed beside the file description.",
        "imageUrl": "/ncdac.png",
        "datetime": "2024-03-01",
        "category": [
            "Python",
            "SQL"
        ],
        "more": {
            "href": "https://github.com/cllghn/NCDACdb",
            "text": "Read more on Github"
        }
    },
    {
        "id": 3,
        "title": "Análisis de Redes Sociales",
        "description": "A manual on social network analysis in Spanish. This manual is a work in progress and is intended to be a resource for students. I co-developed it with Sean Everton (NPS) and Gen. Augusto Alvarez (Ret.) (ESGE) while teaching a course on social network analysis at the Escuela Superior de Guerra (ESGE) in Peru.",
        "imageUrl": "/core-esge.png",
        "datetime": "2018-01-01",
        "category": [
            "R"
        ],
        "more": {
            "href": "https://github.com/cllghn/arso",
            "text": "Read more on Github"
        }
    },
    {
        "id": 4,
        "title": "cllghn.me",
        "description": "My personal website created with React, Next.js, TailwindCSS, and a wee bit of D3. Code is public and available on Github.",
        "imageUrl": "/cllghn.png",
        "datetime": "2024-11-27",
        "category": [
            "JavaScript"
        ],
        "more": {
            "href": "https://github.com/cllghn/cllghn-site",
            "text": "Read more on Github"
        }
    },
    {
        "id": 5,
        "title": "Mapping Gray Maritime Networks",
        "description": "Once upon a time, I was lucky enough to  partner with colleagues at FFI to leverage live ship tracking (AIS) data and network science for increaded maritime awareness. Out work resulted in a couple publications and our team was awarded the 2019 FFI Innovation Award.",
        "imageUrl": "/stnm_landing.png",
        "datetime": "2019-12-15",
        "category": [
            "R"
        ],
        "more": {
            "href": "https://nps.edu/-/gray-networks-nps-uses-social-network-analysis-to-cast-a-bright-light-on-maritime-awareness",
            "text": "Read more here"
        }
    },
    {
        "id": 6,
        "title": "SQL 101",
        "description": "I built a small tutorial on how to use SQL in support of our corrections analysts. This is a simple HTML document with some styling provided by CSS, Bootstrap, and some minimal JavaScript. The actual lessons are hosted as individual R .qmd files in the docs/presentation subdirectory. ",
        "imageUrl": "/sql101.png",
        "datetime": "2024-08-15",
        "category": [
            "SQL",
            "JavaScript",
            "R"
        ],
        "more": {
            "href": "https://cllghn.github.io/sql101/",
            "text": "Go to the page"
        }
    }
]